<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"94f329f589df153da49be0143fc022e5a8f49d8a78187c678fb31191934bf41a","plan_job_ref":"Job Terraform Plan #816 at https://github.com/cal-itp/data-infra/actions/runs/22363846705","plan_out_hash":"d4ce20952272561371fd15131f8d675490223b7726e891e3bc353d5360a8958c","plan_hash":"08618b3ae55d72cde781cb23794a40c213348d7e20848b217bd472d7da999730","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/metabase/us__
<details>
<summary>Plan: 13 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_cloud_run_service_iam_binding.metabase will be created
+   resource "google_cloud_run_service_iam_binding" "metabase" {
+       etag     = (known after apply)
+       id       = (known after apply)
+       location = "us-west2"
+       members  = [
+           "allUsers",
        ]
+       project  = (known after apply)
+       role     = "roles/run.invoker"
+       service  = "metabase"
    }

  # google_cloud_run_v2_service.metabase will be created
+   resource "google_cloud_run_v2_service" "metabase" {
+       conditions              = (known after apply)
+       create_time             = (known after apply)
+       creator                 = (known after apply)
+       delete_time             = (known after apply)
+       deletion_protection     = false
+       effective_annotations   = (known after apply)
+       effective_labels        = {
+           "goog-terraform-provisioned" = "true"
        }
+       etag                    = (known after apply)
+       expire_time             = (known after apply)
+       generation              = (known after apply)
+       id                      = (known after apply)
+       ingress                 = "INGRESS_TRAFFIC_ALL"
+       invoker_iam_disabled    = true
+       last_modifier           = (known after apply)
+       latest_created_revision = (known after apply)
+       latest_ready_revision   = (known after apply)
+       launch_stage            = (known after apply)
+       location                = "us-west2"
+       name                    = "metabase"
+       observed_generation     = (known after apply)
+       project                 = "cal-itp-data-infra"
+       reconciling             = (known after apply)
+       terminal_condition      = (known after apply)
+       terraform_labels        = {
+           "goog-terraform-provisioned" = "true"
        }
+       traffic_statuses        = (known after apply)
+       uid                     = (known after apply)
+       update_time             = (known after apply)
+       uri                     = (known after apply)
+       urls                    = (known after apply)

+       scaling {
+           min_instance_count = 1
        }

+       template {
+           max_instance_request_concurrency = (known after apply)
+           service_account                  = "metabase-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+           timeout                          = (known after apply)

+           containers {
+               build_info = (known after apply)
+               image      = "us-west2-docker.pkg.dev/cal-itp-data-infra/ghcr/cal-itp/data-infra/metabase:production"

+               env {
+                   name  = "JAVA_OPTS"
+                   value = "-Xmx2048m"
                }
+               env {
+                   name  = "MB_DB_DBNAME"
+                   value = "metabase"
                }
+               env {
+                   name  = "MB_DB_HOST"
+                   value = "127.0.0.1"
                }
+               env {
+                   name  = "MB_DB_PASS"
#                    (1 unchanged attribute hidden)

+                   value_source {
+                       secret_key_ref {
+                           secret  = "metabase-password"
+                           version = "latest"
                        }
                    }
                }
+               env {
+                   name  = "MB_DB_TYPE"
+                   value = "postgres"
                }
+               env {
+                   name  = "MB_DB_USER"
+                   value = "metabase"
                }

+               liveness_probe {
+                   failure_threshold     = 3
+                   initial_delay_seconds = 0
+                   period_seconds        = 10
+                   timeout_seconds       = 1

+                   http_get {
+                       path = "/"
+                       port = 3000
                    }
                }

+               ports {
+                   container_port = 3000
+                   name           = (known after apply)
                }

+               resources {
+                   limits = {
+                       "cpu"    = "2"
+                       "memory" = "4096Mi"
                    }
                }

+               startup_probe {
+                   failure_threshold     = 10
+                   initial_delay_seconds = 60
+                   period_seconds        = 5
+                   timeout_seconds       = 2

+                   http_get {
+                       path = "/"
+                       port = 3000
                    }
                }

+               volume_mounts {
+                   mount_path = "/cloudsql"
+                   name       = "cloudsql"
                }
            }

+           scaling (known after apply)

+           volumes {
+               name = "cloudsql"

+               cloud_sql_instance {
+                   instances = (known after apply)
                }
            }
        }

+       traffic {
+           percent = 100
+           type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_compute_region_network_endpoint_group.metabase will be created
+   resource "google_compute_region_network_endpoint_group" "metabase" {
+       id                    = (known after apply)
+       name                  = "metabase"
+       network               = (known after apply)
+       network_endpoint_type = "SERVERLESS"
+       project               = "cal-itp-data-infra"
+       region                = "us-west2"
+       self_link             = (known after apply)

+       cloud_run {
+           service = "metabase"
        }

+       psc_data (known after apply)
    }

  # google_sql_database.metabase will be created
+   resource "google_sql_database" "metabase" {
+       charset         = (known after apply)
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "metabase"
+       name            = "metabase"
+       project         = "cal-itp-data-infra"
+       self_link       = (known after apply)
    }

  # google_sql_database_instance.metabase will be created
+   resource "google_sql_database_instance" "metabase" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_18"
+       deletion_protection            = true
+       dns_name                       = (known after apply)
+       dns_names                      = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "metabase"
+       node_count                     = (known after apply)
+       private_ip_address             = (known after apply)
+       project                        = "cal-itp-data-infra"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-west2"
+       replica_names                  = (known after apply)
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       replica_configuration (known after apply)

+       replication_cluster (known after apply)

+       settings {
+           activation_policy           = "ALWAYS"
+           availability_type           = "ZONAL"
+           connector_enforcement       = (known after apply)
+           disk_autoresize             = true
+           disk_autoresize_limit       = 0
+           disk_size                   = (known after apply)
+           disk_type                   = (known after apply)
+           edition                     = "ENTERPRISE"
+           effective_availability_type = (known after apply)
+           pricing_plan                = "PER_USE"
+           tier                        = "db-g1-small"
+           user_labels                 = (known after apply)
+           version                     = (known after apply)

+           backup_configuration (known after apply)

+           connection_pool_config (known after apply)

+           data_cache_config (known after apply)

+           insights_config (known after apply)

+           ip_configuration (known after apply)

+           location_preference (known after apply)

+           read_pool_auto_scale_config (known after apply)
        }
    }

  # google_sql_user.metabase will be created
+   resource "google_sql_user" "metabase" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "metabase"
+       name                    = "metabase"
+       password_wo             = (write-only attribute)
+       password_wo_version     = 1
+       project                 = "cal-itp-data-infra"
+       sql_server_user_details = (known after apply)
    }

  # module.lb-http.google_compute_backend_service.default["metabase"] will be created
+   resource "google_compute_backend_service" "default" {
+       connection_draining_timeout_sec = 300
+       creation_timestamp              = (known after apply)
+       enable_cdn                      = false
+       fingerprint                     = (known after apply)
+       generated_id                    = (known after apply)
+       id                              = (known after apply)
+       load_balancing_scheme           = "EXTERNAL"
+       name                            = "metabase-backend-metabase"
+       port_name                       = (known after apply)
+       project                         = "cal-itp-data-infra"
+       protocol                        = (known after apply)
+       self_link                       = (known after apply)
+       session_affinity                = (known after apply)
+       timeout_sec                     = (known after apply)

+       backend {
+           balancing_mode                      = "UTILIZATION"
+           capacity_scaler                     = 1
+           group                               = (known after apply)
+           max_connections                     = (known after apply)
+           max_connections_per_endpoint        = (known after apply)
+           max_connections_per_instance        = (known after apply)
+           max_in_flight_requests              = (known after apply)
+           max_in_flight_requests_per_endpoint = (known after apply)
+           max_in_flight_requests_per_instance = (known after apply)
+           max_rate                            = (known after apply)
+           max_rate_per_endpoint               = (known after apply)
+           max_rate_per_instance               = (known after apply)
+           max_utilization                     = (known after apply)
#            (3 unchanged attributes hidden)
        }

+       cdn_policy (known after apply)

+       iap {
+           enabled                     = false
+           oauth2_client_secret_sha256 = (sensitive value)
        }

+       log_config (known after apply)
    }

  # module.lb-http.google_compute_global_forwarding_rule.http[0] will be created
+   resource "google_compute_global_forwarding_rule" "http" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = "34.117.213.44"
+       ip_protocol           = (known after apply)
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "metabase"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "80"
+       project               = "cal-itp-data-infra"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # module.lb-http.google_compute_global_forwarding_rule.https[0] will be created
+   resource "google_compute_global_forwarding_rule" "https" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = "34.117.213.44"
+       ip_protocol           = (known after apply)
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "metabase-https"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "443"
+       project               = "cal-itp-data-infra"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # module.lb-http.google_compute_region_network_endpoint_group.serverless_negs["neg-metabase-us-west2"] will be created
+   resource "google_compute_region_network_endpoint_group" "serverless_negs" {
+       id                    = (known after apply)
+       name                  = "neg-metabase-us-west2"
+       network               = (known after apply)
+       network_endpoint_type = "SERVERLESS"
+       project               = "cal-itp-data-infra"
+       region                = "us-west2"
+       self_link             = (known after apply)

+       cloud_run {
+           service = "metabase"
        }

+       psc_data (known after apply)
    }

  # module.lb-http.google_compute_target_http_proxy.default[0] will be created
+   resource "google_compute_target_http_proxy" "default" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       name               = "metabase-http-proxy"
+       project            = "cal-itp-data-infra"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       self_link          = (known after apply)
+       url_map            = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/urlMaps/metabase-https-redirect"
    }

  # module.lb-http.google_compute_target_https_proxy.default[0] will be created
+   resource "google_compute_target_https_proxy" "default" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       name               = "metabase-https-proxy"
+       project            = "cal-itp-data-infra"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       quic_override      = "NONE"
+       self_link          = (known after apply)
+       ssl_certificates   = [
+           "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/sslCertificates/metabase-cert",
        ]
+       tls_early_data     = (known after apply)
+       url_map            = (known after apply)
    }

  # module.lb-http.google_compute_url_map.default[0] will be created
+   resource "google_compute_url_map" "default" {
+       creation_timestamp = (known after apply)
+       default_service    = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "metabase-url-map"
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #816](https://github.com/cal-itp/data-infra/actions/runs/22363846705)